Revit 2024 API
UISaveAsOptions Properties
The UISaveAsOptions type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ShowOverwriteWarning
 Identifies if UI should show an overwrite warning dialog.
See Also
UISaveAsOptions Class
Autodesk.Revit.UI Namespace